# <center>Pandas Assignment</center>

Import pandas and numpy with their aliases

In [2]:

import pandas as pd
import numpy as np

Create a variable a = pd.Series([ 100, 200, 300, 400])

In [64]:
# a = 
a=pd.Series([100,200,300,400])

Print a, and data type

In [65]:
print(a)
print(type(a))

0    100
1    200
2    300
3    400
dtype: int64
<class 'pandas.core.series.Series'>

Using indexing access the element 300 from the series a.

In [66]:
a.iloc[2]

300

What are the values of index for series a?

In [67]:
for i in a.index:
    print (i)

0
1
2
3

In [68]:
a.index

RangeIndex(start=0, stop=4, step=1)

Change the index to  ['c', 'a', 'b', 'd']

In [69]:
a=a.reindex(index=['c','a','b','d'])

In [75]:
a = a.rename(index={0: 'c', 1: 'a', 2: 'b',3: 'd'})
a

c    100
a    200
b    300
d    400
dtype: int64

Access the value in the series with index 'd'

In [9]:
a.loc['d']

400

Sort the values wrt to the index and print it

In [10]:
a=a.sort_index(ascending=True)

Create a new Pandas Series b having index as 'e', 'f', and 'g' and value 800,450,100 and print it

In [11]:
# b = 
b=pd.Series([800,450,100], index=['e','f','g'])
b

e    800
f    450
g    100
dtype: int64

Append b series at the end of a series

In [12]:
# a =

a=pd.concat([a,b],axis=0)

In [13]:
#print a again after appending b into it
a

a    200
b    300
c    100
d    400
e    800
f    450
g    100
dtype: int64

Sort the values in descending order of a and print the index of the sorted series

In [14]:
# a = 

a.sort_index(ascending=False)

g    100
f    450
e    800
d    400
c    100
b    300
a    200
dtype: int64

## Pandas DataFrame

### Part 1

Create a pandas dataframe df from the series 'a' that we used in the last section, print the dataframe

In [15]:
# df = 
df=pd.DataFrame(a)

In [16]:
df

     0
a  200
b  300
c  100
d  400
e  800
f  450
g  100

What is the shape of the datafarme <br>
(also, what does it imply?)

In [17]:

df.shape

#It means that there are 7 rows and 1 column

(7, 1)

Hey! remember shape (7,1) implies dataframe has 7 rows and 1 column.

What is the index of the dataframe, is it same as the series 'a'

In [18]:
# yep its same as the series.

print the head and tail of the dataframe. <br>
Additional - (what does head and tali represent?)

In [19]:
df.head()

     0
a  200
b  300
c  100
d  400
e  800

In [20]:

df.tail()

     0
c  100
d  400
e  800
f  450
g  100

Rename the column of the dataframe as 'points'

In [21]:

df.columns=(['POINTS'])

df

   POINTS
a     200
b     300
c     100
d     400
e     800
f     450
g     100

Create another Series 'fruits', which contains random names of fruits from ['orange','mango','apple']. The series should contain 7 elements, randomly selected from ['orange','mango','apple']

In [35]:
#Create fruits array

fruits = np.array(['orange','mango','apple'])

In [36]:
#Create series fruits out of fruits array
fruits =pd.Series(fruits)

fruits

0    orange
1     mango
2     apple
dtype: object

Change the index of fruits to the index of dataframe df

In [49]:
fruits=pd.Series(fruits, index=['a','b','c'])

fruits

a    orange
b     mango
c     apple
dtype: object

Add this fruits series as a new column to the dataframe df with its column name as 'fruits'
<br>print the head of the dataframe to verify

In [52]:
fruits=pd.DataFrame(fruits)
fruits.columns=(['Fruits'])

In [53]:

fruits

   Fruits
a  orange
b   mango
c   apple

## Pandas Concatenation

Create a dataframe  d1 where the cols are  ‘city’ : [‘Chandigarh’, ‘Delhi’, ‘Kanpur’, ‘Chennai’, ‘Manali’ ] and ‘Temperature’ : [15, 22, 20, 26,-2]

In [3]:
d1 = pd.DataFrame({'City':['Chandigarh', 'Delhi', 'Kanpur', 'Chennai', 'Manali' ], 'Temperature' : [15, 22, 20, 26,-2]})

Print(d1)

In [4]:
d1

         City  Temperature
0  Chandigarh           15
1       Delhi           22
2      Kanpur           20
3     Chennai           26
4      Manali           -2

What is the shape of d1.

In [5]:
d1.shape

(5, 2)

Set city = d1['city']

In [6]:
city=d1['City']

print city <br>
What is the type of city.

In [7]:
print(city)
print(type(city))

0    Chandigarh
1         Delhi
2        Kanpur
3       Chennai
4        Manali
Name: City, dtype: object
<class 'pandas.core.series.Series'>

Create another datafeame 'd2' where the columns are <br>
'city' - ['Bengalaru','Coimbatore','Srirangam','Pondicherry'] <br>
'Temperature' - [24,35,36,39]

In [8]:
d2 =pd.DataFrame({'City':['Bengaluru', 'Coimbatore', 'Srirangam', 'Pondicherry'], 'Temperature' : [24,35,36,39]}) 

d2

          City  Temperature
0    Bengaluru           24
1   Coimbatore           35
2    Srirangam           36
3  Pondicherry           39

print the shape of this dataframe

In [9]:
d2.shape

(4, 2)

merge the two dataframes together, save it in a new dataframe named 'd3'

In [50]:
d3 = pd.concat((d1,d2), axis=0).reset_index()
d3

   index         City  Temperature
0      0   Chandigarh           15
1      1        Delhi           22
2      2       Kanpur           20
3      3      Chennai           26
4      4       Manali           -2
5      0    Bengaluru           24
6      1   Coimbatore           35
7      2    Srirangam           36
8      3  Pondicherry           39

In [54]:
d3['Temperature'].dtype

dtype('int64')

Select the part of the dataframe such that it contains cities wherer temp is less then or equal to 20 <br>
How many cities are there?

In [11]:
d3[d3['Temperature']<=20]['City']

0    Chandigarh
2        Kanpur
4        Manali
Name: City, dtype: object

Select the part of the dataframe such that it contains the cities where tempearature greater than or equal to 35

In [12]:
d3[d3['Temperature']>=35]['City']

6     Coimbatore
7      Srirangam
8    Pondicherry
Name: City, dtype: object

## Applying functions to columns and creating new columns

We need to create another column in d3, which contains  a boolean value for each city to indicate whether it's a union territory or not. 
- HINT: Chandigarh, Pondicherry and Delhi are only 3 union territories here.

In [61]:
# write function here

def is_ut(x):
    if (x=='Chandigarh' or x=='Pondicherry' or x=='Delhi'):
        return True
    else:
        return False
    
'''
union_terrs = ["Chandigarh", "Pondicherry", "Delhi"]
d3["Territory"] = d3["City"].isin(union_terrs).astype(bool)
'''

'\nunion_terrs = ["Chandigarh", "Pondicherry", "Delhi"]\nd3["Territory"] = d3["City"].isin(union_terrs).astype(bool)\n'

In [62]:
d3['Territory'] = d3['City'].map(is_ut)
d3

   index         City  Temperature  Farenheit  Territory
0      0   Chandigarh           15       59.0       True
1      1        Delhi           22       71.6       True
2      2       Kanpur           20       68.0      False
3      3      Chennai           26       78.8      False
4      4       Manali           -2       28.4      False
5      0    Bengaluru           24       75.2      False
6      1   Coimbatore           35       95.0      False
7      2    Srirangam           36       96.8      False
8      3  Pondicherry           39      102.2       True

In [63]:
# print d3

d3

   index         City  Temperature  Farenheit  Territory
0      0   Chandigarh           15       59.0       True
1      1        Delhi           22       71.6       True
2      2       Kanpur           20       68.0      False
3      3      Chennai           26       78.8      False
4      4       Manali           -2       28.4      False
5      0    Bengaluru           24       75.2      False
6      1   Coimbatore           35       95.0      False
7      2    Srirangam           36       96.8      False
8      3  Pondicherry           39      102.2       True

The temperatures mentioned in ‘Temperature’ column are mentioned in Celsius, we need another column which contains the same in Fahrenheit.

HINT - 
- Define a function c_to_f which takes input temp in celsius and returns a value with temperature in Fahrenheit.
- To check: c_to_f(10) should return 50.

In [20]:
# write function here

#extra code
d3 = d3.assign(Fahrenheit = lambda x: (9/5)*x['Temperature']+32)

d3

   index         City  Temperature  Territory  Fahrenheit
0      0   Chandigarh           15       True        59.0
1      1        Delhi           22       True        71.6
2      2       Kanpur           20      False        68.0
3      3      Chennai           26      False        78.8
4      4       Manali           -2      False        28.4
5      0    Bengaluru           24      False        75.2
6      1   Coimbatore           35      False        95.0
7      2    Srirangam           36      False        96.8
8      3  Pondicherry           39       True       102.2

In [55]:
def c_tof_(c):
    f=(9/5)*(int(c))+32
    return (float(f))

In [56]:
# check function c_to_f(10)

c_tof_(10)

50.0

In [57]:
d3.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   index        9 non-null      int64
 1   City         9 non-null      object
 2   Temperature  9 non-null      int64
dtypes: int64(2), object(1)
memory usage: 344.0+ bytes

In [59]:
# apply function c_to_f to d3 to create a column 'temp_farenhiet'

d3['Farenheit'] = d3['Temperature'].map(c_tof_)
d3

   index         City  Temperature  Farenheit
0      0   Chandigarh           15       59.0
1      1        Delhi           22       71.6
2      2       Kanpur           20       68.0
3      3      Chennai           26       78.8
4      4       Manali           -2       28.4
5      0    Bengaluru           24       75.2
6      1   Coimbatore           35       95.0
7      2    Srirangam           36       96.8
8      3  Pondicherry           39      102.2

## Indexing and selecting rows in DataFrame

Select subset of the dataframe d1 such that it contains the cities which are union territories.

In [161]:
union_terrs = ["Chandigarh", "Pondicherry", "Delhi"]
d1["Territory"] = d1["City"].isin(union_terrs).astype(bool)
d1[d1['Territory']==True]['City']

0    Chandigarh
1         Delhi
Name: City, dtype: object

Select a subset of the dataframe d1 such that it contains the cities which only have temperature above 90 Farenhiet.

In [162]:
union_terrs = ["Chandigarh", "Pondicherry", "Delhi"]
d3["Territory"] = d3["City"].isin(union_terrs).astype(bool)

Select only the first three rows of the dataframe d1.

In [163]:
d1[0:3]

         City  Temperature  Territory
0  Chandigarh           15       True
1       Delhi           22       True
2      Kanpur           20      False

Select all the rows and last two columns in the dataframe.

In [165]:
d3.iloc[:,-2:]

   Territory  Fahrenheit
0       True        59.0
1       True        71.6
2      False        68.0
3      False        78.8
4      False        28.4
5      False        75.2
6      False        95.0
7      False        96.8
8       True       102.2

## Groupby

In [108]:
# Create a dataframe using dictionary of your choice

technologies   = ({
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas","Hadoop","Spark","Python"],
    'Fee' :[22000,25000,23000,24000,26000,25000,25000,22000],
    'Duration':['30days','50days','55days','40days','60days','35days','55days','50days'],
    'Discount':[1000,2300,1000,1200,2500,1300,1400,1600]
                })
df = pd.DataFrame(technologies, columns=['Courses','Fee','Duration','Discount'])
print(df)

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300
2   Hadoop  23000   55days      1000
3   Python  24000   40days      1200
4   Pandas  26000   60days      2500
5   Hadoop  25000   35days      1300
6    Spark  25000   55days      1400
7   Python  22000   50days      1600

In [109]:
# Use Groupby of single column with aggregate sum()

df2 = df.groupby('Courses').sum()
print(df2)

           Fee  Discount
Courses
Hadoop   48000      2300
Pandas   26000      2500
PySpark  25000      2300
Python   46000      2800
Spark    47000      2400

In [110]:
# Use Groupby of single column with aggregate count()

df2 = df.groupby('Courses')['Fee'].agg(['sum','count'])
print(df2)

           sum  count
Courses
Hadoop   48000      2
Pandas   26000      1
PySpark  25000      1
Python   46000      2
Spark    47000      2

In [120]:
# Use Groupby of single column with aggregate min() and max()
result = df.groupby('Courses')['Fee'].aggregate(['min','max'])
print(result)

           min    max
Courses
Hadoop   23000  25000
Pandas   26000  26000
PySpark  25000  25000
Python   22000  24000
Spark    22000  25000

In [118]:
# Use Groupby of any 2 columns with aggregate mean()
val = df[['Discount','Fee']].mean()
print(val)

Discount     1537.5
Fee         24000.0
dtype: float64

In [121]:
# Use Groupby of any 2 columns with aggregate min() and max()

result = df.groupby('Courses').aggregate({'Duration':'count','Fee':['min','max']})
print(result)

        Duration    Fee
           count    min    max
Courses
Hadoop         2  23000  25000
Pandas         1  26000  26000
PySpark        1  25000  25000
Python         2  22000  24000
Spark          2  22000  25000

## Data Range

Create a pandas daterange where starting date is 1st of January,2020 and end date is 1st of April 2021, store it in a new variable named 'a'

In [83]:
 a = pd.date_range(start='2020-01-01', end='2021-04-01')

print a

In [84]:

a

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06', '2020-01-07', '2020-01-08',
               '2020-01-09', '2020-01-10',
               ...
               '2021-03-23', '2021-03-24', '2021-03-25', '2021-03-26',
               '2021-03-27', '2021-03-28', '2021-03-29', '2021-03-30',
               '2021-03-31', '2021-04-01'],
              dtype='datetime64[ns]', length=457, freq='D')

What is the len of a?

In [86]:
len(a)

457

What is the type of a?

In [87]:
type(a)

pandas.core.indexes.datetimes.DatetimeIndex